{
	"name": "A New Adventure",
	"dialogues":
	{
		"quest_offer":
		{
			"text": "Hello there, new adventurer! So you're new to Caelkirk? Oh boy, this is exciting... you're going to love it here! Assuming you're not brutally killed by a monster that is... But not to worry, you might actually stand a chance here!Are you ready then?",
			"responses":
			{
				"Let's go!": {"name": "intro"}
			}
		},
		"intro":
		{
			"text": "Great. Would you like to hear a little bit about this land, or just jump right in?",
			"responses":
			{
				"Tell me more": {"name": "more_info"},
				"Let's get to it!": {"name": "first_task"}
			}
		},
		"more_info":
		{
			"text": "Caelkirk is a vast land with many monsters, castles, quests, and hidden areas to explore.  By completing quests, you will gain skill XP to level up your abilities and gold coins you can spend around the world! Some quests will even grant you rare items and access to special features.",
			"responses":
			{
				"Skills/XP?": {"name": "skills_xp_info"},
				"Gold coins?": {"name": "gold_coins"},
				"Let's get to it!": {"name": "first_task"}
			}
		},
		"skills_xp_info":
		{
			"text": "Everyone in Caelkirk has special attributes called \"skills\".  By completing actions you can train your skills and level them up, becoming even stronger and more profecient at your task of choice. You can open up your skills menu by pressing \"L\".",
			"responses":
			{
				"Gold coins?": {"name": "gold_coins"},
				"Let's get to it!": {"name": "first_task"}
			}
		},
		"gold_coins":
		{
			"text": "Yes! Oh there is so much wealth to be acquired here. A skilled adventurer can make a fortune! By killing monsters, selling items to shops and other players, completing quests, and more, you will earn coins.  There are 4 tiers of currency in Caelkirk.  Copper, Silver, Gold, and Platinum coins.  50 Copper coins is equal to 1 Silver, 50 Silvers is 1 Gold, and so on. Got it?",
			"responses":
			{
				"Skills/XP?": {"name": "skills_xp_info"},
				"Let's get to it!": {"name": "first_task"}
			}
		},
		"first_task":
		{
			"text": "Alright, your first task is to go outside next door to the woodcutting shack and talk to Ulric. He'll teach you about the skill of Woodcutting. I put a marker on your map for you in case you have trouble finding it.",
			"responses":
			{
				"Thanks!": 
				{
					"name": "",
					"event": "onQuestStarted"
				}
			}
		},
		"robert_player_returned":
		{
			"text": "What are you doing back? Are you having trouble finding Ulric? Just go outside the door, go to the fountain, turn left, and look for a small woodcutting shack.  He'll be right outside.  Also, you can look for the next quest objective by finding the \"!\" on your minimap.",
			"responses":
			{
				"Okay": {"name": ""}
			}
		},
		"ulric_refuse":
		{
			"text": "Who're you? I'm not expecting you.  Go back and talk to Robert Cromwell at the inn to get started.",
			"responses":
			{
				"Okay": {"name": ""}
			}
		},
		"ulric_intro":
		{
			"text": "'ey there.  Names's Ulric.  I run the woodcutting shop around here.  So you want to learn aboot woodcuttin', eh?",
			"responses":
			{
				"Okay": {"name": "ulric_woodcutting_tutorial"},
				"No thanks": {"name": "ulric_alright_then"}
			}
		},
		"ulric_alright_then":
		{
			"text": "Alright then.  When you decide you want to learn, come back and talk to me.",
			"responses":
			{
				"Okay": {"name": ""}
			}
		},
		"ulric_woodcutting_tutorial":
		{
			"text": "Excellent.  Woodcutting is great skill in Caelkirk, if you ask me.  The most important, if you ask me.  By practicing your woodcutting skill, you'll increase your woodcutting level and be able to get more logs per tree, and chop each tree down faster.",
			"responses":
			{
				"->": {"name": "ulric_woodcutting_tutorial2"}
			}
		},
		"ulric_woodcutting_tutorial2":
		{
			"text": "By harvestin' trees, you're stockin' up a real valuable resource.  You can sell logs at the markets, or craft 'em into important items.  Heck, you can just stock 'em up and smell 'em if you're like me.",
			"responses":
			{
				"->": {"name": "ulric_woodcutting_tutorial3"}
			}
		},
		"ulric_woodcutting_tutorial3":
		{
			"text": "Anyways, choppin' down trees is probably a little different in this land than you're used to.  To chop down a tree, you need an axe strong enough for the wood type.  You can read about the different axes and tree types in the Woodcutting book.",
			"responses":
			{
				"->": {"name": "ulric_woodcutting_tutorial4"}
			}
		},
		"ulric_woodcutting_tutorial4":
		{
			"text": "Once you've got a good enough axe, head up to the tree trunk and left click it.  There's no need to hold down your left mouse button.  Each time you click, you'll chop the tree, and might even harvest a log. After so many logs, you'll chop down the tree completely.  You'll want to move onto a new one after that, until it grows back.",
			"responses":
			{
				"->": {"name": "ulric_woodcutting_tutorial5"}
			}
		},
		"ulric_woodcutting_tutorial5":
		{
			"text": "I'm gonna give you a bronze axe here, and I want you to go chop down some oak tree, alright? I'll even pay you for yer work.  I'm going to need you to harvest 10 oak logs, alright? Once you have enough, bring them back to me for yer reward. Remeeber, one click per chop.  You'll get the hang of it.",
			"responses":
			{
				"Sounds good": 
				{
					"name": "",
					"event": "beginLogChopping"
				}
			}
		},
		"ulric_not_done_yet":
		{
			"text": "What're ye doing back so soon?  I need ye to get me 10 Oak Logs. I even gave ye that fancy axe.  Get to choppin'.",
			"responses":
			{
				"Okay": {"name": ""}
			}
		},
		"ulric_finished":
		{
			"text": "Nice. I see ye've brought plenty o logs.  Ye did that pretty quick.  I can see the makin's of a fine lumberjack in ye one day.  I'll let ye keep the axe and the logs ye chopped down.  Ye should go talk to Eva Teffan next.  She can show ye some cool things to craft from these logs.",
			"responses":
			{
				"My payment?": {"name": "ulric_finished2"}
			}
		},
		"ulric_finished2":
		{
			"text": "Yer payment?! I already gave you the greatest gift there is! The pure JOY of being in the woods cuttin' some treees!!",
			"responses":
			{
				"...": {"name": "ulric_finished3"}
			}
		},
		"ulric_finished3":
		{
			"text": "Ugh fine. You city folk are all the same. Here's 20 copper for yer troubles.  But I'm keepin' half of yer logs",
			"responses":
			{
				"Goodbye": {"name": "ulric_finished4"}
			}
		},
		"ulric_finished4":
		{
			"text": "Ye should go talk to Eva Teffan next.  She can show ye some cool things to craft from these logs. She's over there in that yuppy cottage with those blasted sheep behind it.",
			"responses":
			{
				"Goodbye": {"name": "",
							"event": "ulricFinished"}
			}
		},
		"eva_intro":
		{
			"text": "Well hello there.  My name is Eva Teffan.  I'm a master craftswoman, and I can teach you a little bit about my trade.  Are you interested?",
			"responses":
			{
				"Sounds great": {"name": "eva_tutorial_1"},
				"No thanks": {"name": "eva_alright_then"}
			}
		},
		"eva_returned":
		{
			"text": "Did you have trouble finding the sheeps? They're just out back! Bring some wool and we'll get started, okay? Bye!",
			"responses":
			{
				"Bye": {"name": ""}
			}
		},
		"eva_not_expected":
		{
			"text": "Diddlee dee, diddlee dum. I love crafting!",
			"responses":
			{
				"Huh.": {"name": ""}
			}
		},
		"eva_alright_then":
		{
			"text": "Alright then young traveller.  Come and talk to me if you want some hands-on instruction in the crafting trade.",
			"responses":
			{
				"Goodbye": {"name": ""}
			}
		},
		"eva_tutorial_1":
		{
			"text": "Excellent! To start off with, crafting is the art of creating something beautiful out of lesser parts, it's a fantastic process.  You can craft all sorts of wonderful tools and many other things!",
			"responses":
			{
				"Cool!": {"name": "eva_tutorial_2"}
			}
		},
		"eva_tutorial_2":
		{
			"text": "As you progress in your crafting skill, you'll be able to craft more and more complex items that can be worth a lot of money! For the more complex items, you'll have to discover schematics on how to build them.",
			"responses":
			{
				"Interesting.": {"name": "eva_tutorial_3"}
			}
		},
		"eva_tutorial_3":
		{
			"text": "For most common items though, a decent crafting level and a little bit of intuition is all you'll need. Oh, and the required crafting materials, of course. Speaking of which, we'll need to get you some materials so can learn to craft something.",
			"responses":
			{
				"What do I need?": {"name": "eva_tutorial_4"}
			}
		},
		"eva_tutorial_4":
		{
			"text": "Hmm... well that depends I guess on what we're going to craft... Let's see... I think we'll craft... a nice fishing pole!  Especially since I want you to meet my favorite-est fishing pal after we're done.",
			"responses":
			{
				"Sounds good to me.": {"name": "eva_tutorial_5"}
			}
		},
		"eva_tutorial_5":
		{
			"text": "Splendid!  Okay, so to make a fishing pole, we're going to need some string and wood.  There's several ways to make string, but one of my favorites is super, duper cute!  You go out back to the sheeps, shear some of their fluffy-wuffy wool, and then craft some string out of it! Easy-peasy!",
			"responses":
			{
				"Uh huh...": {"name": "eva_tutorial_6"}
			}
		},
		"eva_tutorial_6":
		{
			"text": "Alrighty then! Here's some shears, go shear a sheep and bring his wool back! Then we'll get to business.'",
			"responses":
			{
				"Okay, be right back": {"name": "",
										"event": "beginShearSheep"}
			}
		}
	}
}